{"config": [{"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_1", "input_dtype": "float32", "nb_filter": 32, "bias": true, "border_mode": "valid", "activation": "linear", "batch_input_shape": [null, 1, 96, 96], "dim_ordering": "th", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 2, "trainable": true, "W_regularizer": null, "nb_filter": 64, "bias": true, "border_mode": "valid", "activation": "linear", "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "nb_row": 2, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_2", "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 2, "trainable": true, "W_regularizer": null, "nb_filter": 128, "bias": true, "border_mode": "valid", "activation": "linear", "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "nb_row": 2, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_3", "b_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 500, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "name": "dense_1", "input_dim": null, "activity_regularizer": null, "trainable": true, "init": "uniform", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"output_dim": 500, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "name": "dense_2", "input_dim": null, "activity_regularizer": null, "trainable": true, "init": "normal", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"output_dim": 30, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear", "name": "dense_3", "input_dim": null, "activity_regularizer": null, "trainable": true, "init": "normal", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_6"}, "class_name": "Activation"}], "keras_version": "1.1.0", "class_name": "Sequential"}